Repository: nikerz1406/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/ChainOfResponsibilities/README.po
Languages: vi

source: `Chain Of Responsibilities`__
vi: `Chuỗi Liên Đới`__

source: Purpose:
vi: Zweck:

source: To build a chain of objects to handle a call in sequential order. If one object cannot handle a call, it delegates the call to the next in the chain and so forth.
vi: Dùng để xây dựng một chuỗi các đối tượng mà ở đó các sự kiện được gọi tuần tự. Nếu một trong các đối tượng không có hàm xử lý, thì hàm cha của hàm xử lý đó sẽ chuyển sự kiện sang đối tượng tiếp theo cho đến hết.

source: Examples:
vi: Ví dụ:

source: logging framework, where each chain element decides autonomously what to do with a log message
vi: Hệ thống ghi nhận nhật ký, nơi mà bất cứ hành động nào cũng được ghi nhận tùy biến tương ứng với mỗi dòng nhật ký

source: a Spam filter
vi: Một bộ lọc Thư rác

source: Caching: first object is an instance of e.g. a Memcached Interface, if that "misses" it delegates the call to the database interface
vi: Bộ nhớ đệm: đối tượng đầu tiên là một thực tiễn của ví dụ. Tại cổng giao tiếp lưu trữ dữ liệu tạm, nếu không gọi được thì đại diện của nó sẽ gọi cổng giao tiếp của cơ sở dữ liệu

source: UML Diagram
vi: Sơ đồ UML

source: Code
vi: Mã

source: You can also find this code on `GitHub`_
vi: Bạn có thể tìm thấy mã ở `GitHub`_

source: Test
vi: Kiểm thử
