Repository: nikerz1406/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/README.po
Languages: vi

source: I think the problem with patterns is that often people do know them but don't know when to apply which.
vi: Tôi nghĩ vấn đề với những mẫu thiết kế này thường là mọi người đều biết đến chúng nhưng họ chưa biết hoặc chưa thấy cách vận dụng của chúng hiệu quả

source: Patterns
vi: Những mẫu thiết kế

source: The patterns can be structured in roughly three different categories. Please click on **the title of every pattern's page** for a full explanation of the pattern on Wikipedia.
vi: Những mẫu này có thể phân làm 3 loại Hãy nhấn vào **tiêu đề của mỗi mẫu trong trang** để xem chi tiết các giải thích mẫu có ở trang Wikipedia

source: Contribute
vi: Đóng góp

source: Please feel free to fork and extend existing or add your own examples and send a pull request with your changes! To establish a consistent code quality, please check your code using `PHP CodeSniffer`_ against `PSR2 standard`_ using ``./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .``.
vi: Hãy góp sức ủng hộ dự án và kết thừa dự án hoặc bạn có thể đóng góp ví dụ của bạn vàgửi một yêu cầu thay cập nhật thay đổi đó! Để chất lượng mã được ổn định, hãy kiểm tra mã của bảng bằng `PHP CodeSniffer` với tiếu chuẩn PSR2 :`./vendor/bin/phpcs -p --standard=PSR2 --ignore=vendor .`.

source: License
vi: Giấy phép

source: Copyright (c) 2011 - 2016 `Dominik Liebler`_ and `contributors`_
vi: Bản quyền (c) 2011 - 2016 `Dominik Liebler`_ cũng những người đóng góp

source: Permission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the 'Software'), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:
vi: Giấy phép được cấp, miễn phí dưới các hình thức, bất cứ cá nhân nào muốn dùng một bản sao chép của phần mềm này và các tài liệu liên quan ( của phần 'Software'), cho phép mọi hình thức thỏa thuận với phần mềm, bao gồm không giới hạn quyền sử dụng, sao chép, chính sửa, thêm mới, công khai, phân phối, giấy phép con, hoặc bán bản sao chép của phần mềm, kể cả quyền phần mềm những người được ủy quyền phần mềm, tuân thủ những quy định sau:

source: The above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.
vi: Thông báo bản quyền và các quyền trênTrong tất cả các bản sao chép hoặc bản thay đổi có phần đóng góp của phần mềm gốc một cách đáng kể (không hoạt động được nếu bị thiếu)

source: THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
vi: PHẦN MỀM ĐƯỢC CUNG CẤP 'NGUYÊN TRẠNG', KHÔNG BẢO HÀNH DƯỚI BẤT CỨ HÌNH THỨC NÀO, CHI TIẾT HOẶC TỔNG QUÁT, BAO QUÁT NHƯNG KHÔNG GIỚI HẠN VỀ KHẢ NĂNG THƯƠNG MẠI, PHÙ HỢP CHO MỘT MỤC ĐÍCH CỤ THỂ VÀ KHÔNG VI PHẠM. TRONG MỌI TRƯỜNG HỢP TÁC GIẢ HOẶC NGƯỜI GIỮ BẢN QUYỀN SẼ KHÔNG CHỊU TRÁCH NHIỆM PHÁP LÝ VỀ BẤT KỲ KHIẾU NẠI NÀO,CÁC THIỆT HẠI HOẶC CÁC TRÁCH NHIỆM PHÁP LÝ NÀO KHÁC, DÙ TRONG MỘT SỰ VỤ HỢP LÝ, VÔ LÝ HAYCÁCH NÀO KHÁC, PHÁT SINH TỪ, NGOÀI HOẶC TRONG LIÊN QUAN ĐẾN PHẦN MỀM HOẶC VIỆC SỬ DỤNG HAY CÁC GIAO DỊCH KHÁC TRONG PHẦN MỀM
