Repository: nikerz1406/DesignPatternsPHP
Catalog: locale/*/LC_MESSAGES/Behavioral/Memento/README.po
Languages: vi

source: It provides the ability to restore an object to it's previous state (undovia rollback) or to gain access to state of the object, without revealingit's implementation (i.e., the object is not required to have a functionto return the current state).
vi: Es bietet die Möglichkeit, den vorherigen Zustand eines Objekts wiederherzustellen (Rückgängigmachen durch Rollback) oder Zugriff auf den Zustand des Objekts zu erhalten, ohne seine Implementierung offenzulegen (d.h. das Objekt muss keine Funktion haben, um den aktuellen Zustand wiederherzustellen).

source: The memento pattern is implemented with three objects: the Originator, a Caretaker and a Memento.
vi: Das Memento-Muster wird mit drei Objekten umgesetzt: dem Urheber, einem Verwalter und einem Memento.

source: Memento – an object that *contains a concrete unique snapshot of state* of any object or resource: string, number, array, an instance of class and so on. The uniqueness in this case does not imply the prohibition existence of similar states in different snapshots. That means the state can be extracted as the independent clone. Any object stored in the Memento should be *a full copy of the original object rather than a reference* to the original object. The Memento object is a "opaque object" (the object that no one can or should change).
vi: Memento - ein Objekt, das eine konkrete, eindeutige Momentaufnahme des Zustands eines beliebigen Objekts oder einer beliebigen Ressource enthält: Zeichenfolge, Nummer, Array, eine Instanz einer Klasse usw. Die Eindeutigkeit impliziert in diesem Fall nicht das Verbot der Existenz ähnlicher Zustände in verschiedenen Momentaufnahmen. Das bedeutet, dass der Zustand als der unabhängige Klon extrahiert werden kann.Jedes Objekt, das im Memento gespeichert ist, sollte eine vollständige Kopie des Originalobjekts und nicht eine Referenz auf das Originalobjekt sein. Das Memento-Objekt ist ein \'undurchsichtiges Objekt\' (ein Objekt, das niemand ändern kann oder sollte).

source: Originator – it is an object that contains the *actual state of an external object is strictly specified type*. Originator is able to create a unique copy of this state and return it wrapped in a Memento. The Originator does not know the history of changes. You can set a concrete state to Originator from the outside, which will be considered as actual. The Originator must make sure that given state corresponds the allowed type of object. Originator may (but not should) have any methods, but they *they can't make changes to the saved object state*.
vi: Urheber - es handelt sich um ein Objekt, das den tatsächlichen Zustand eines externen Objekts enthält, dessen Typ streng spezifiziert ist. Der Urheber ist in der Lage, eine eindeutige Kopie dieses Zustands zu erstellen und in einem Memento verpackt zurückzugeben. Der Absender kennt die Geschichte der Änderungen nicht. Sie können von außen einen konkreten Zustand auf Urheber setzen, der als aktuell betrachtet wird. Der Absender muss sicherstellen, dass der angegebene Zustand dem zulässigen Objekttyp entspricht. Der Urheber kann (sollte aber nicht) über beliebige Methoden verfügen, kann aber keine Änderungen am gespeicherten Objektzustand vornehmen.

source: Caretaker *controls the states history*. He may make changes to an object; take a decision to save the state of an external object in the Originator; ask from the Originator snapshot of the current state; or set the Originator state to equivalence with some snapshot from history.
vi: Verwalter kontrollieren die Historie der Status. Er kann Änderungen an einem Objekt vornehmen, eine Entscheidung treffen, den Zustand eines externen Objekts im Urheber speichern, vom Urheber eine Momentaufnahme des aktuellen Zustands anfordern oder den Urheber-Zustand auf Gleichstand mit einer Momentaufnahme aus der Historie setzen.

source: Examples
vi: Ví dụ

source: The seed of a pseudorandom number generator
vi: Der Startpunkt eines Pseudozufallszahlengenerators

source: The state in a finite state machine
vi: Der Zustand in einem endlichen Zustandsautomaten

source: Control for intermediate states of `ORM Model <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ before saving
vi: Kontrolle für Zwischenzustände des ORM-Modells <https://de.wikipedia.org/wiki/Objektrelationale_Abbildung>`_ vor dem Speichern

source: You can also find this code on `GitHub`_
vi: Du kannst diesen Code auch auf `GitHub` einsehen_
